app/controllers/static_pages_controller.rb

  def home
    showrecentconvo = Time.now - 10.hours
    @conversations = Event.where( "start_at > ? AND topic = ?", showrecentconvo, 'Conversation' )
    @conversationsall = Event.where( "start_at > ? AND topic = ?", showrecentconvo, 'Conversation' ) #is this used?

    @events = Event.where( "start_at > ? AND (topic = ? OR topic = ?)", showrecentconvo, 'DropIn', 'Group Problem Solving' ).order('start_at ASC').paginate(page: params[:page], :per_page => 9)
---
SELECT "events".* FROM "events" WHERE (start_at < '2020-09-03 18:16:57.333532' AND start_at > '2020-09-03 17:16:57.333551' AND topic = 'Conversation') ORDER BY "events"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE (start_at > '2020-11-06 13:32:06.926365' AND topic = 'Conversation') LIMIT $1  [["LIMIT", 11]]
SELECT COUNT(*) FROM "events" WHERE (start_at > '2020-09-03 15:16:57.309171' AND topic = 'Conversation')