app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @recaptcha_checked = verify_recaptcha(model: @user)

    if @recaptcha_checked
      if @user.save
---
INSERT INTO "users" ("name", "email", "author", "created_at", "updated_at", "encrypted_password", "permalink", "confirmation_token", "confirmation_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def set_user
    @user = User.find_by_permalink(params[:permalink]) || current_user
    if @user.merchandises.any?
---
SELECT "users".* FROM "users" WHERE "users"."permalink" = $1 LIMIT $2  [["permalink", "favicon"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE LOWER("users"."permalink") = LOWER($1) LIMIT $2  [["permalink", "testuser"], ["LIMIT", 1]]